{
  "blogs": [
    {
      "title": "The Art of Healthy Living",
      "body": "In a world where stress and mental health issues are becoming more commonplace than ever, it’s important to raise awareness and support each other through these issues, that’s where a wellness event can come in handy. These events can prove to be an invigorating and transformative experience for both employees and employers by providing an opportunity to prioritize well-being and foster a healthy work environment. This article will guide you through the essential steps to prepare for a wellness event, so your next effort can be a resounding success.",
      "author": "Poppy Robbinson",
      "id": 1
    },
    {
      "title": "Secrets To A Restful Nights Sleep",
      "body": "Good sleep is a precious commodity that often eludes us in our fast-paced lives. From hectic schedules to daily stressors, there are numerous factors that can disrupt our sleep quality. In this blog, we’ll explore six common reasons that affect the quality of our sleep and delve into the fascinating world of sleep science. Additionally, we’ll unveil an essential element that can enhance your pre-sleep experience, leading to a more restful slumber.",
      "author": "Ruth Williams",
      "id": 2
    },
    {
      "title": "What To Know About Zinc Supplements",
      "body": "If a healthcare provider recommends zinc supplements, you can work with them to select the best form and dose for you. And since zinc can interact with certain medications, medical conditions, and other supplements, you might need to adjust the quantity.\n\nNumerous zinc supplements include zinc gluconate, picolinate, acetate, and citrate. Zinc also exists in various forms, from lozenges and capsules to drops.\n\nStill, the NIH does not recommend getting your daily recommended value of zinc by taking supplements. Instead, try to meet your zinc requirements through your diet.1 \n\nAdditionally, obtaining your zinc through food can broaden your overall nutrient intake. Zinc-containing foods offer other vital nutrients, including protein, fiber, vitamins and minerals, and health-protective antioxidants. \n\nGetting your zinc solely through your diet also reduces the potential risks of taking too much zinc in supplement form.",
      "author": "Cynthia Sass",
      "id": 3
    },
    {
      "title": "Schizophrenia, Voices, and Suicidal Ideation",
      "body": "For me, psychosis involves auditory hallucinations (hearing voices and sounds) and is the most dangerous part of my illness. The last time I went to the emergency room for symptoms of psychosis, the doctor asked me if I heard voices, and when I answered that I was, he asked an important question, \"Do you do what the voices tell you to do?\" And unfortunately, my answer was yes. If you can't immediately see the danger in this scenario, try to think of it this way, imagine taking orders from something that is not real. It's alarming. Schizophrenia, voices, combined with suicidal ideation, is even more alarming.\n\nSchizophrenia, Hearing Voices, and Suicidal Ideation\nI have friends who also have schizophrenia (some have schizoaffective disorder) who can argue with their voices or ignore what they are saying and what they tell them to do. I wish I had that kind of experience or control over hearing voices because it would show that I had some insight into the fact that I am ill and experiencing symptoms, something I lack during episodes of psychosis. I am consumed and preoccupied with the voices I hear and do what they direct me to do. \n\nBeing unable to ignore the commands of the voices I hear is particularly dangerous for me because the voices I hear have frequently told me to kill myself. The times I have tried to end my life have all had to do with what the voices I heard were telling me. \n\nSuicidal Ideation Is Present Only When Hearing Voices Due to My Schizophrenia\nDaily, I don't struggle with suicidal ideation (thoughts of suicide). On an average day (with the absence of psychosis), my most negative thoughts are to occasionally feel sorry for myself and wonder why I have to struggle with schizophrenia and an anxiety disorder. It's so rare for me to feel hopeless that even entertaining negative thoughts (like self-pity or asking the question, why me) doesn't stay with me long. And those negative thoughts are not persistent or all-consuming. Suicidal ideation is only present when I hear voices due to schizophrenia.\n\nI manage my illness by treating it as my primary job. I prioritize and take my treatment seriously, like taking my medications, seeing my doctors regularly, monitoring my sleep, exercising, etc., because I'm trying to avoid psychosis at all costs. After all, there is a high chance my life depends upon it. ",
      "author": "Rebecca Chamaa",
      "id": 4
    }
  ]
}